<a href="https://colab.research.google.com/github/jdr98/JabaliSalvajeTP1/blob/JabaliSalavaje/Copia_de_TP1_Jabali_Salvaje.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline


url = "https://raw.githubusercontent.com/jdr98/JabaliSalvajeTP1/master/train.csv"

In [0]:
df = pd.read_csv(url)

In [7]:
# ver primeras lineas del DF
df.head()

   id keyword  ...                                               text target
0   1     NaN  ...  Our Deeds are the Reason of this #earthquake M...      1
1   4     NaN  ...             Forest fire near La Ronge Sask. Canada      1
2   5     NaN  ...  All residents asked to 'shelter in place' are ...      1
3   6     NaN  ...  13,000 people receive #wildfires evacuation or...      1
4   7     NaN  ...  Just got sent this photo from Ruby #Alaska as ...      1

[5 rows x 5 columns]

In [8]:
# Cuantas filas y columnas hay
# 7613 filas por 5 columnas
df

         id keyword  ...                                               text target
0         1     NaN  ...  Our Deeds are the Reason of this #earthquake M...      1
1         4     NaN  ...             Forest fire near La Ronge Sask. Canada      1
2         5     NaN  ...  All residents asked to 'shelter in place' are ...      1
3         6     NaN  ...  13,000 people receive #wildfires evacuation or...      1
4         7     NaN  ...  Just got sent this photo from Ruby #Alaska as ...      1
...     ...     ...  ...                                                ...    ...
7608  10869     NaN  ...  Two giant cranes holding a bridge collapse int...      1
7609  10870     NaN  ...  @aria_ahrary @TheTawniest The out of control w...      1
7610  10871     NaN  ...  M1.94 [01:04 UTC]?5km S of Volcano Hawaii. htt...      1
7611  10872     NaN  ...  Police investigating after an e-bike collided ...      1
7612  10873     NaN  ...  The Latest: More Homes Razed by Northern Calif...      1

[7613 rows x 5 columns]

In [9]:
df.columns

Index(['id', 'keyword', 'location', 'text', 'target'], dtype='object')

In [10]:
# tipo de dato de cada columna
df.dtypes

id           int64
keyword     object
location    object
text        object
target       int64
dtype: object

In [11]:
# agrupo por ciudad
agrupado_ciudad = df.groupby(['location', 'text'])
agrupado_ciudad.mean()

                                                                                id  target
location               text
                       Maybe that's what happens when a tornado meets ...   9703.0     1.0
  Glasgow              @Caitsroberts see U the night wee bArra to get ...  10822.0     0.0
  Melbourne, Australia @DestinyTheGame @Bungie @PlayStation Getting ki...   2579.0     0.0
  News                 70 Years After Atomic Bombs Japan Still Struggl...   3955.0     1.0
  å_                   WCW @catsandsyrup THA BITCH IS FIRE                  5338.0     0.0
...                                                                            ...     ...
å_: ?? ÌÑ ? : ?        someone just reblogged a picture of self harm s...   5918.0     0.0
å_å_Los Mina Cityã¢   Hollywood Movie About Trapped Miners Released i...   9788.0     0.0
å¡å¡Midwest Û¢Û¢     @sarahmcpants @JustJon I'll give him a titty tw...  10023.0     0.0
åÊ(?Û¢`?Û¢å«)??      @junsuisengen changing my weapon!                   10293.0     0.0
åø\_(?)_/åø            On the eve of Jon Stewart leaving The Daily Sho...   3478.0     1.0

[5044 rows x 2 columns]

In [12]:
# contar por location

tweet_per_location = df['location'].value_counts()
tweet_per_location

USA                                 104
New York                             71
United States                        50
London                               45
Canada                               29
                                   ...
Clean World                           1
WonderlandÛÓ ?????? ???? ??????      1
Chester                               1
proudly South African                 1
Lytham St Anne's                      1
Name: location, Length: 3341, dtype: int64

In [13]:
# 
df['text'].iloc[-10:-1]

7603    Officials say a quarantine is in place at an A...
7604    #WorldNews Fallen powerlines on G:link tram: U...
7605    on the flip side I'm at Walmart and there is a...
7606    Suicide bomber kills 15 in Saudi security site...
7607    #stormchase Violent Record Breaking EF-5 El Re...
7608    Two giant cranes holding a bridge collapse int...
7609    @aria_ahrary @TheTawniest The out of control w...
7610    M1.94 [01:04 UTC]?5km S of Volcano Hawaii. htt...
7611    Police investigating after an e-bike collided ...
Name: text, dtype: object

In [14]:
# contar tweet mas compartidos
tweet_per_text = df['text'].value_counts()
tweet_per_text

11-Year-Old Boy Charged With Manslaughter of Toddler: Report: An 11-year-old boy has been charged with manslaughter over the fatal sh...        10
The Prophet (peace be upon him) said 'Save yourself from Hellfire even if it is by giving half a date in charity.'                               6
He came to a land which was engulfed in tribal war and turned it into a land of peace i.e. Madinah. #ProphetMuhammad #islam                      6
#Bestnaijamade: 16yr old PKK suicide bomber who detonated bomb in ... http://t.co/KSAwlYuX02 bestnaijamade bestnaijamade bestnaijamade beÛ_     6
Madhya Pradesh Train Derailment: Village Youth Saved Many Lives                                                                                  5
                                                                                                                                                ..
Bloody hell it's already been upgraded to 'rioting'. #hyperbole #saintsfc                                                                        1
Helping Hand: In Mumbai 2 TTEs take charge of helpline to calm anxious relatives - The Indian Exp... http://t.co/B9KUylcxg4 MumbaiTimes          1
We have different moral systems. Mine rejects the mass murder of innocents yours explicitly endorses such behavior. https://t.co/qadRKEJZ9T      1
Author Interview Michele Rosenthal-author of Your Life After Trauma.                                                                             1
Damnnnn $GMCR got obliterated -26% ;that should pay HUGE to whomever played accordingly                                                          1
Name: text, Length: 7503, dtype: int64

In [15]:
# contar tweets por keyword
tweet_per_kw = df['keyword'].value_counts()
tweet_per_kw

fatalities               45
armageddon               42
deluge                   42
sinking                  41
damage                   41
                         ..
forest%20fire            19
epicentre                12
threat                   11
inundation               10
radiation%20emergency     9
Name: keyword, Length: 221, dtype: int64

In [16]:
# cuantos tweets son reales (1) y cuantos NO lo son (0)
tweet_real_or_not = df['target'].value_counts()
tweet_real_or_not

0    4342
1    3271
Name: target, dtype: int64

In [17]:
df.isnull()

         id  keyword  location   text  target
0     False     True      True  False   False
1     False     True      True  False   False
2     False     True      True  False   False
3     False     True      True  False   False
4     False     True      True  False   False
...     ...      ...       ...    ...     ...
7608  False     True      True  False   False
7609  False     True      True  False   False
7610  False     True      True  False   False
7611  False     True      True  False   False
7612  False     True      True  False   False

[7613 rows x 5 columns]

In [18]:
# Ver último 10 celdas
df.tail(10)

         id keyword  ...                                               text target
7603  10862     NaN  ...  Officials say a quarantine is in place at an A...      1
7604  10863     NaN  ...  #WorldNews Fallen powerlines on G:link tram: U...      1
7605  10864     NaN  ...  on the flip side I'm at Walmart and there is a...      1
7606  10866     NaN  ...  Suicide bomber kills 15 in Saudi security site...      1
7607  10867     NaN  ...  #stormchase Violent Record Breaking EF-5 El Re...      1
7608  10869     NaN  ...  Two giant cranes holding a bridge collapse int...      1
7609  10870     NaN  ...  @aria_ahrary @TheTawniest The out of control w...      1
7610  10871     NaN  ...  M1.94 [01:04 UTC]?5km S of Volcano Hawaii. htt...      1
7611  10872     NaN  ...  Police investigating after an e-bike collided ...      1
7612  10873     NaN  ...  The Latest: More Homes Razed by Northern Calif...      1

[10 rows x 5 columns]

In [38]:
#Limpiar Nas del data frame
df.location.dropna(inplace = True)
print(len(df))

5080

In [29]:
df.tail(10)

         id  keyword  ...                                               text target
7570  10821  wrecked  ...  Cramer: Iger's 3 words that wrecked Disney's s...      0
7571  10822  wrecked  ...  @Caitsroberts see U the night wee bArra to get...      0
7572  10823  wrecked  ...  @Kirafrog @mount_wario Did you get wrecked again?      1
7573  10824  wrecked  ...  Had an awesome time gettin wrecked at bowling ...      0
7574  10825  wrecked  ...  Cramer: 3 words that wrecked DIS stock - http:...      0
7575  10826  wrecked  ...  On the bright side I wrecked http://t.co/uEa0t...      0
7577  10829  wrecked  ...  @widda16 ... He's gone. You can relax. I thoug...      0
7579  10831  wrecked  ...  Three days off from work and they've pretty mu...      0
7580  10832  wrecked  ...  #FX #forex #trading Cramer: Iger's 3 words tha...      0
7581  10833  wrecked  ...  @engineshed Great atmosphere at the British Li...      0

[10 rows x 5 columns]

In [43]:
#Defino Id como indice
df_id = df.set_index(['id'])
df_id

       keyword  ... target
id              ...
48      ablaze  ...      1
49      ablaze  ...      0
50      ablaze  ...      1
52      ablaze  ...      0
53      ablaze  ...      0
...        ...  ...    ...
10826  wrecked  ...      0
10829  wrecked  ...      0
10831  wrecked  ...      0
10832  wrecked  ...      0
10833  wrecked  ...      0

[5080 rows x 4 columns]